{
  "project": [
    {
      "title": "hr-recruitment-website",
      "name": "HR Recruitment Website",
      "company": "RMI",
      "description": "A web application designed to streamline the recruitment process, enabling HR teams to manage job postings, applications, interviews, and candidate profiles efficiently.",
      "techs": [
        { "name": "React JS" },
        { "name": "Tailwind CSS" },
        { "name": "React Query" },
        { "name": "React Router" }
      ],
      "contributions": [
        {
          "content": "Developed the front-end interface for HR staff using ReactJS."
        },
        {
          "content": "Implemented a secure login system with role-based access for administrators and hr staff."
        },
        {
          "content": "Designed as a responsive interface to improve usability across devices."
        }
      ]
    },
    {
      "title": "approval-hub",
      "name": "RYS Approval Hub",
      "company": "RYS and Affiliated Companies",
      "description": "An approval workflow system to centralize and automate the approval of internal requests, reducing processing times and improving efficiency.",
      "techs": [{ "name": "Power Application" }, { "name": "Power Automate" }],
      "contributions": [
        {
          "content": "Designed and implemented an approval pipeline for multiple departments and multiple applications."
        },
        {
          "content": "Designed to cater and easily add and remove applications, adjust request variables, as admin."
        },
        {
          "content": "Easily access multiple companies requests from multiple applications."
        },
        {
          "content": "Conducted thorough testing to ensure smooth workflow automation."
        }
      ]
    },
    {
      "title": "request-for-payment",
      "name": "Request For Payment",
      "company": "RYS and Affiliated Companies",
      "description": "A payment request management system for submitting, tracking, and processing internal payment requests.",
      "techs": [{ "name": "Power Application" }, { "name": "Power Automate" }],
      "contributions": [
        {
          "content": "Built the back-end and front-end logic for tracking payment request statuses."
        },
        {
          "content": "Designed and implemented a user-friendly interface with designed for submitting and monitoring requests."
        },
        {
          "content": "Developed a notification system to alert approvers of pending requests."
        },
        {
          "content": "Optimized database queries to ensure efficient processing of large volumes of data."
        }
      ]
    },
    {
      "title": "business-trip",
      "name": "Official Business Trip / OB and Trip Ticket QR Scanner",
      "company": "RYS and Affiliated Companies",
      "description": "An organization-wide application for managing and tracking official business trips of all employees.",
      "techs": [{ "name": "Power Apps" }, { "name": "Power Automate" }],
      "contributions": [
        {
          "content": "Developed an application that will cater to mobile and desktop, as well as implementing scanner to the application."
        },
        {
          "content": "Designed an intuitive user interface for drivers and office staff"
        }
      ]
    },
    {
      "title": "leave-application",
      "name": "RYS Leave Application",
      "company": "RYS and Affiliated Companies",
      "description": "A leave management platform for employees to apply for, track, and manage their leaves with approval workflows.",
      "techs": [{ "name": "Power Application" }, { "name": "Power Automate" }],
      "contributions": [
        {
          "content": "Developed a mobile application for leave requests and approvals"
        },
        {
          "content": "Designed to be easy accessible and intuitivity-first"
        },
        {
          "content": "Integrated email and in-app notifications for leave status updates."
        },
        {
          "content": "Implemented a calendar view for better visualization of leave schedules."
        }
      ]
    },
    {
      "title": "ticketing-system",
      "name": "Ticket System",
      "company": "RYS and Affiliated Companies",
      "description": "An internal IT support ticketing system to track and resolve employee-reported technical issues.",
      "techs": [{ "name": "Power Application" }, { "name": "Power Automate" }],
      "contributions": [
        {
          "content": "Designed and developed ticket submission and tracking of it issues"
        },
        {
          "content": "Built a reporting feature to analyze ticket resolution times and trends."
        },
        {
          "content": "Implemented a scoring system for engagement purpose and transparency."
        },
        {
          "content": "Integrated authentication for users and support staff with role-based access."
        }
      ]
    },
    {
      "title": "docket-system",
      "name": "Docket System",
      "company": "RMI",
      "description": "A web-based application for managing and tracking email and letters, ensuring accuracy and transparency in tracking.",
      "techs": [{ "name": "Power Application" }, { "name": "Power Automate" }],
      "contributions": [
        {
          "content": "Developed the logic for generating and managing emails and letters."
        },
        {
          "content": "Designed an intuitive interface for administration users, staff and managers."
        },
        {
          "content": "Designed for easy accessibility and interchangeability of the routes."
        }
      ]
    }
  ]
}
